package ru.itmo.lessons.courseworks.game2.logic;

public class Scenes {

    public String firstSceneCode;
    public String firstSceneAction = """
            Каждое утро Лисёнок просыпался, завтракал и
            шёл увидеться с Бельчонком. Это утро не было
            исключением. Лисёнок пришёл на их обычное место
            встречи, но Бельчонка там не было. Лисёнок ждал,
            ждал, но так и не смог дождаться своего друга.
            " Бельчонок не пропустил еще ни одной встречи,
            вдруг он попал в беду." - подумал Лисёнок. Как поступить Лисенку?
                            
            Выбери ответ
            1) Вернуться домой
            2) Отправиться на поиски
            3) Меню
            """;

    public String goToSearchCode;
    public String goToSearchScene = """
            Все лесные жители были заняты своими делами и не
            обращали внимания на Лисёнка и его проблему.
            Но вдруг кто нибудь видел Бельчонка...
            Лисёнок не знал, что ему делать. Помогите ему.
                        
            Выбери ответ
            1) Попытаться разузнать о Бельчонке у лесных жителей
            2) Искать Бельчонка в одиночку
            3) Меню
            """;

    public String finalSceneCode;
    public String finalSceneScene = """
            Вернувшись домой, Лисёнок нашёл там Бельчонка.
            Оказалось, что Бельчонок пришёл на место встречи
            раньше и увидел там рой злобных пчел. Он поспешил
            предупредить об этом Лисёнка, но они разминулись.
            Наконец-то друзья нашли друг друга! 
            Игра завершилась успехом 
            """;



}






