import ru.itmo.lessons.lesson7.Pupil;

import java.util.Arrays;
import java.util.Scanner;

public class TestClass {
    public static void main(String[] args) {
        //Pupil pupil = new Pupil();


            }
        }


/*
Класс Ученик создается со следующими
характеристиками:
имя (тип String) +
возраст (тип int) ++
название изучаемого предмета (тип String)
уровень знаний (тип int)
методом:

учиться(навык_учителя) - уровень знаний ученика повышается на рандомное значение в диапазоне [0, навык_учителя]

Класс Учитель создается со следующими
харатеристиками:
имя (тип String) +
возраст (тип int) ++
название преподаваемого предмета (тип String)
навык учителя (тип int) - максисмум, на который может быть увеличен уровень значний ученика
методом: учить(обучаемый)

Класс Директор создается со следующими
харатеристиками:
имя (тип String) +
возраст (тип int) ++
методами:
объявить начало занятий() - вывод информации в косоль
объявить окончание занятий занятий() - вывод информации в косоль

Класс Школа создается со следующими

харатеристиками:
название - задается при создании объекта и не может быть изменено в последствии
директор - школа не может функционировать без директора
учителя[] - массив
ученики[] - массив

 */
